/*
 * Copyright (c) 2019-2025 Allwinner Technology Co., Ltd. ALL rights reserved.
 *
 * Allwinner is a trademark of Allwinner Technology Co.,Ltd., registered in
 * the the People's Republic of China and other countries.
 * All Allwinner Technology Co.,Ltd. trademarks are used with permission.
 *
 * DISCLAIMER
 * THIRD PARTY LICENCES MAY BE REQUIRED TO IMPLEMENT THE SOLUTION/PRODUCT.
 * IF YOU NEED TO INTEGRATE THIRD PARTY¡¯S TECHNOLOGY (SONY, DTS, DOLBY, AVS OR
 * MPEGLA, ETC.)
 * IN ALLWINNERS¡¯SDK OR PRODUCTS, YOU SHALL BE SOLELY RESPONSIBLE TO OBTAIN
 * ALL APPROPRIATELY REQUIRED THIRD PARTY LICENCES.
 * ALLWINNER SHALL HAVE NO WARRANTY, INDEMNITY OR OTHER OBLIGATIONS WITH RESPECT
 * TO MATTERS
 * COVERED UNDER ANY REQUIRED THIRD PARTY LICENSE.
 * YOU ARE SOLELY RESPONSIBLE FOR YOUR USAGE OF THIRD PARTY¡¯S TECHNOLOGY.
 *
 *
 * THIS SOFTWARE IS PROVIDED BY ALLWINNER"AS IS" AND TO THE MAXIMUM EXTENT
 * PERMITTED BY LAW, ALLWINNER EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING WITHOUT LIMITATION REGARDING
 * THE TITLE, NON-INFRINGEMENT, ACCURACY, CONDITION, COMPLETENESS, PERFORMANCE
 * OR MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
 * IN NO EVENT SHALL ALLWINNER BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS, OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <interrupt.h>
#include "hal_spi.h"
#include "hal_dma.h"


/******************fix me*********************/
#define hal_readl(addr)             (*((volatile unsigned long  *)(addr)))
#define hal_writel(v, addr)		(*((volatile unsigned long  *)(addr)) = (unsigned long)(v))
#define hal_readb(addr)             (*((volatile unsigned char  *)(addr)))
#define hal_writeb(v, addr)		(*((volatile unsigned char  *)(addr)) = (unsigned char)(v))

#define krhino_mm_alloc(size) malloc(size)
#define krhino_mm_free(ptr) 	free(ptr)
/******************fix me*********************/

#if (1)
#define CONFIG_SUNXI_SPI_CPU_XFER_ONLY
#endif

#define SPI_ERR(fmt, arg...) printf("%s()%d " fmt, __func__, __LINE__, ##arg)
#define SPI_INIT(fmt, arg...) printf("%s()%d " fmt, __func__, __LINE__, ##arg)

#if (0)
#define SPI_INFO_LEVEL
#endif

#if (0)
#define SPI_DATA_LEVEL
#endif

#if (0)
#define SPI_DUMPREG_LEVEL
#endif


#ifdef SPI_INFO_LEVEL
#define SPI_INFO(fmt, arg...) printf("%s()%d " fmt, __func__, __LINE__, ##arg)
#else
#define SPI_INFO(fmt, arg...)                                                  \
    do {                                                                   \
    } while (0);
#endif

static uint32_t g_spi_regbase[HAL_SPI_MASTER_MAX];
static uint32_t g_spi_irqnum[HAL_SPI_MASTER_MAX];
static sunxi_spi_t g_sunxi_spi[HAL_SPI_MASTER_MAX];


#define u32 uint32_t
//#define u8 uint8_t
struct sunxi_ccm_reg
{
    u32 pll_cpux_ctrl;      /*0x0*/
    u8 reserved_0x4[12];
    u32 pll_ddr0_ctrl;      /*0x10*/
    u8 reserved_0x14[4];
    u32 pll_ddr1_ctrl;      /*0x18*/
    u8 reserved_0x1C[4];
    u32 pll_peri0_ctrl;     /*0x20*/
    u8 reserved_0x24[4];
    u32 pll_peri1_ctrl;     /*0x28*/
    u8 reserved_0x2C[68];
    u32 pll_hsic_ctrl;      /*0x70*/
    u8 reserved_0x74[1164];
    u32 cpux_axi_cfg;       /*0x500*/
    u8 reserved_0x504[12];
    u32 psi_ahb1_ahb2_cfg;  /*0x510*/
    u8 reserved_0x514[8];
    u32 ahb3_cfg;           /*0x51c*/
    u32 apb1_cfg;           /*0x520*/
    u32 apb2_cfg;           /*0x524*/
    u8 reserved_0x528[24];
    u32 mbus_cfg;           /*0x540*/
    u8 reserved_0x544[316];
    u32 ce_clk;             /*0x680*/
    u8 reserved_0x684[8];
    u32 ce_bgr;             /*0x68c*/
    u32 ve_clk;             /*0x690*/
    u8 reserved_0x694[8];
    u32 ve_bgr;             /*0x69c*/
    u8 reserved_0x6A0[108];
    u32 dma_gate_reset;     /*0x70c*/
    u8 reserved_0x710[48];
    u32 avs_clk;            /*0x740*/
    u8 reserved_0x744[8];
    u32 avs_bgr;            /*0x74c*/
    u8 reserved_0x750[108];
    u32 iommu_bgr;          /*0x7bc*/
    u8 reserved_0x7C0[64];
    u32 dram_clk;           /*0x800*/
    u32 mbus_gate;/*0x804*/
    u32 pll_ddr_aux;        /*0x808*/
    u32 dram_bgr;           /*0x80c*/
    u32 nand_clk;           /*0x810*/
    u8 reserved_0x814[24];
    u32 nand_bgr;           /*0x82c*/
    u32 sdmmc0_clk;         /*0x830*/
    u32 sdmmc1_clk;         /*0x834*/
    u32 sdmmc2_clk;         /*0x838*/
    u8 reserved_0x83C[16];
    u32 smhc_bgr;           /*0x84c*/
    u8 reserved_0x850[188];
    u32 uart_bgr;           /*0x90c*/
    u8 reserved_0x910[12];
    u32 twi_bgr;            /*0x91c*/
    u8 reserved_0x920[28];
    u32 scr_bgr;            /*0x93c*/
    u32 spi0_clk_cfg;       /*0x940*/
    u32 spi1_clk_cfg;       /*0x944*/
    u8 reserved_0x948[36];
    u32 spi_gate_reset;     /*0x96c*/
    u8 reserved_0x970[256];
    u32 usb0_clk;           /*0xa70*/
    u8 reserved_0xA74[24];
    u32 usb_bgr;            /*0xa8c*/
};

static inline void dma_free_coherent(void *addr)
{
    void *malloc_ptr = NULL;
    if (!addr)
        return;
    malloc_ptr = (void *)(*(uint32_t *)((uint32_t *)addr - 1));
    krhino_mm_free(malloc_ptr);
}

static inline void *dma_alloc_coherent(size_t size)
{
    void *fake_ptr = NULL;
    void *malloc_ptr = NULL;

    malloc_ptr = krhino_mm_alloc(size + 64);
    if ((uint32_t)malloc_ptr & 0x3) {
        printf("error: krhino_mm_alloc not align to 4 byte\r\n");
    }
    fake_ptr = (void *)((uint32_t)(malloc_ptr + 64) & (~63));
    *(uint32_t *)((uint32_t *)fake_ptr - 1) = (uint32_t)malloc_ptr;

    return fake_ptr;
}

void spi_dump_reg(sunxi_spi_t *sspi, uint32_t offset, uint32_t len)
{
    uint32_t i;
    char buf[64], cnt = 0;

    for (i = 0; i < len; i = i + REG_INTERVAL)
    {
        if (i % HEXADECIMAL == 0)
            cnt += sprintf(buf + cnt, "0x%08lx: ",
                           (uint32_t)(sspi->base + offset + i));

